Tekla.Structures.Drawing.CustomLineType
The CustomLineType class defines the custom line types of the drawing objects.

Tekla.Structures.Drawing.CustomLineType.Name
The Name of the custom line type.

Tekla.Structures.Drawing.CustomLineType.Description
The Description of the custom line type (ASCII representation of the line).

Tekla.Structures.Drawing.CustomLineType.LineDescription
The description of the custom line type.
Description uses the following format:
List of line segments.
Positive value gives length of filled line segment and
negative value gives length of empty line segment.
0 means a dot.

Tekla.Structures.Drawing.CustomLineType.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.CustomLineType.Equals(System.Object)
Returns true if the current object and the given object are equal.
obj: The object we wish to check the equality with.
Returns: True if the given object equals the current object.

Tekla.Structures.Drawing.CustomLineType.GetHashCode
Returns a hash code for the object.
Returns: The hash code for the object.

Tekla.Structures.Drawing.CustomLineType.op_Equality(Tekla.Structures.Drawing.CustomLineType,Tekla.Structures.Drawing.CustomLineType)
Returns true if the current object and the given object are equal.
a: The first object we wish to check the equality with.
b: The second object we wish to check the equality with.
Returns: True if both objects equals each other.

Tekla.Structures.Drawing.CustomLineType.op_Inequality(Tekla.Structures.Drawing.CustomLineType,Tekla.Structures.Drawing.CustomLineType)
Returns true if the current object and the given object are not equal.
a: The first object we wish to check the inequality with.
b: The second object we wish to check the inequality with.
Returns: True if the objects are not equal.

Tekla.Structures.Drawing.CustomLineType.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2